[
  {
    "id": 1,
    "title": "PathFinderSoftware",
    "description": "W tej sekcji opisany został jeden z moich ostatnich projektów które rozwijałem podczas pisania pracy magisterskiej.",
    "details": "PathfinderSoftware to oprogramowanie, które stworzyłem w ramach pracy magisterskiej. Jego głównym zadaniem jest komunikacja z mikrokontrolerem oraz z drugim komputerem w celu sterowania robotem mobilnym typu linefollower. System umożliwia dwukierunkową komunikację z mikrokontrolerem przez port szeregowy – zarówno do sterowania komponentami robota (np. silnikami), jak i do odczytu danych z czujników (np. odległości, światła).Dodatkowo aplikacja umożliwia transmisję obrazu z kamery do drugiego komputera za pośrednictwem technologii WebSocket. Celem stworzenia tego oprogramowania było przetestowanie różnych strategii sterowania robotem oraz analiza ich efektywności i niezawodności w praktyce.",
    "image": "/images/icon_pathfidner.png",
    "galleryFolder": "pathfinder_software"
  },
  {
    "id": 2,
    "title": "Projety Programistyczne",
    "description": "Tutaj znajdują sie reszta projektów porgramistycznych które wykonałem podczas trwania studiów oraz w czasie wolnym.",
    "details": "W tej sekcji prezentuję wybrane projekty programistyczne, które realizowałem zarówno podczas studiów, jak i w czasie wolnym:Quiz App – aplikacja typu CRUD do zarządzania quizami pomagającymi w nauce języka angielskiego. Została napisana w języku Java z wykorzystaniem Android Studio.Snake – gra Snake w dwóch wersjach: graficznej i tekstowej (terminalowej), napisana w Pythonie. Projekt miał na celu zbadanie możliwości terminala oraz poznanie podstaw graficznego programowania aplikacji. Quality Control – aplikacja desktopowa napisana w technologii WPF (C#), służąca do komunikacji z robotem i monitorowania jego parametrów technicznych oraz stanu systemu.Adaline – implementacja od podstaw algorytmu uczenia maszynowego Adaline. Celem aplikacji było znalezienie funkcji liniowej, która oddziela dwa zbiory danych. MyWebCrawler – aplikacja służąca do eksploracji sieci lokalnej i odtworzenia jej struktury, w tym mapowania dostępnych hostów.",
    "image": "/images/icon_programing.png",
    "galleryFolder": "programming_projects"
  },
  {
    "id": 3,
    "title": "Projekty Elektroniczne",
    "description": "Ta sekcja poświęcona jest projektom elektronicznym które wykonałem aby rozwijac swoje hobby.",
    "details": "W czasie wolnym realizuję także projekty elektroniczne, w tym projektowanie i wykonywanie płytek PCB: Libra – moduł wagowy oparty na mikrokontrolerze ESP32. Odczytuje napięcie z tensometru i wyświetla wynik na wyświetlaczu 7-segmentowym. Projekt przewidział możliwość rozbudowy o funkcje IoT (np. zdalny odczyt danych). Zasilacz laboratoryjny – projekt liniowego zasilacza laboratoryjnego, który pozwolił mi na naukę projektowania zasilaczy oraz wdrażania ich w praktyce. Overcharge – płytka PCB zaprojektowana do robota minisumo. Umożliwia podłączenie dwóch silników i ich wzmocnienie (trzykrotne napięcie), a także integrację czujników i sterowanie wszystkimi komponentami robota.",
    "image": "/images/icon_electronicts.png",
    "galleryFolder": "electronicts_projects"
  },
  {
    "id": 4,
    "title": "Projekty Robotyczne",
    "description": "Oprócz elektroni interesuje się równiez mechaniką oraz rozwiazaniami które łączą ze sobą elektronike mechanike i programowanie.",
    "details": "Poniżej przedstawiam projekty, które łączą w sobie elektronikę, mechanikę oraz oprogramowanie – czyli pełne systemy robotyczne: Robot Pathfinder – robot linefollower służący do testowania różnych strategii sterowania, implementowanych z wykorzystaniem PathfinderSoftware. JajkoStępel – urządzenie służące do znakowania jajek przy użyciu sterownika CNC i Arduino. Porusza się w trzech osiach, umożliwiając precyzyjne stemplowanie. Roboty minisumo – mam na swoim koncie kilka konstrukcji robotów typu minisumo, w których testowałem różne podejścia do walki i spychania przeciwnika.",
    "image": "/images/icon_robotics.png",
    "galleryFolder": "robotics_projects"
  },
  {
    "id": 5,
    "title": "Modele 3D",
    "description": "Moim hobby jest równiez druk 3D oraz projektowanie modeli które mozna potem drukwać.",
    "details": "W wolnym czasie zajmuję się również projektowaniem modeli 3D. Najczęściej są to modele przeznaczone do druku 3D, ale tworzę też modele o zastosowaniu technicznym i koncepcyjnym. Projekty te realizuję zarówno hobbystycznie, jak i jako elementy większych konstrukcji mechanicznych.",
    "image": "/images/icon_models.png",
    "galleryFolder": "models_3D"
  }
]